console.log(60 * 60 * 24) //количество секунд в сутках

console.log(60 * 60 * 24 * 30) //количество секунд в 30 сутках

console.log(60 * 60 * 24 * 365) //количество секунд в году

console.log(60 * 24) //количество минут в сутках

console.log(60 * 24 * 365) //количество минут в году

console.log(1024 * 1024) //количество байт в мегабайте

console.log(1024 * 1024 * 1024) //количество байт в гигабайте

console.log(1024 * 1024 * 1024 * 10) //количество байт в 10 гигабайтах

console.log(1024 * 1024 * 1024 * 1024) //количество байт в терабайте

console.log(1024 * 1024 * 1024) //количество килобайт в терабайте