//173.Сформируйте с помощью двух вложенных циклов следующий массив:
// [
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x'],
// 	['x', 'x', 'x', 'x']
// ]
let arr = [];
for (let i = 0; i < 3; i++) {
	arr[i] = []; 
	
	for (let j = 0; j < 4; j++) {
		arr[i].push('x'); 
	}
}
console.log(arr);

// 177. Дан следующий объект:
// let obj = {
// 	1: {
// 		1: 11,
// 		2: 12,
// 		3: 13,
// 	},
// 	2: {
// 		1: 21,
// 		2: 22,
// 		3: 23,
// 	},
// 	3: {
// 		1: 24,
// 		2: 25,
// 		3: 26,
// 	},
// }
// Используя циклы, найдите сумму элементов этого объекта.
let obj = {
	1: {
		1: 11,
		2: 12,
		3: 13,
	},
	2: {
		1: 21,
		2: 22,
		3: 23,
	},
	3: {
		1: 24,
		2: 25,
		3: 26,
	},
}
let sum=0
for (let key in obj){
    let subObj=obj[key]
    for (let  Subkey in subObj){
        sum+=subObj[Subkey]
    }
}
    console.log(sum)
    